src/org/create-a-new-ssh-key.org
#+TITLE: Create a new SSH key
#+DATE: [2021-08-17 Tue 12:44]

1. Open a terminal on your workstation and use the ssh-keygen command to generate a new key
#+BEGIN_EXAMPLE
ssh-keygen -t rsa -f ~/.ssh/[KEY_FILENAME] -C [USERNAME]
#+END_EXAMPLE

2. Restrict access to your private key so that only you can read it and nobody can write to it.
#+BEGIN_EXAMPLE
chmod 400 ~/.ssh/[KEY_FILENAME]
#+END_EXAMPLE

3. Generate a new SSH key that uses Ed25519 algorithm
#+BEGIN_EXAMPLE
ssh-keygen -o -a 100 -t ed25519 -f ~/.ssh/id_ed25519 -C "john@example.com"
#+END_EXAMPLE

4. Adding your key to ssh agent
#+BEGIN_EXAMPLE
ssh-add ~/.ssh/id_ed25519
#+END_EXAMPLE


Reference:
+ https://cloud.google.com/compute/docs/instances/adding-removing-ssh-keys
+ https://medium.com/risan/upgrade-your-ssh-key-to-ed25519-c6e8d60d3c54
